[
  {
    "build_id": 7008,
    "version": "7.0.0",
    "notes": {}
  },
  {
    "build_id": 7030,
    "version": "7.1.0",
    "notes": {
      "Common": [
        [
          {
            "items": [
              [
                "The signing certificate on Simics packages has been updated."
              ]
            ],
            "tag": "list"
          }
        ]
      ],
      "Flexible Return and Event Delivery (FRED)": [
        [
          {
            "items": [
              [
                "Record event data injected at VM-entry over NMI source information in FRED return stack. This is according to FRED 5.0 specification (chapter 9.5.4)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Fixed a bug where the NMI source was not recorded if an NMI occurred in VMX non-root mode with FRED disabled in the guest (fixes HSD-22020188866)."
              ]
            ],
            "tag": "list"
          }
        ]
      ],
      "Intel® 64 public cores": [
        [
          {
            "items": [
              [
                "msr-get, msr-set, msr-read and msr-write commands were added."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "print-msrs command was added."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Removed incorrect enumeration of Intel® SGX from the ",
                {
                  "code": "x86-alderlake",
                  "tag": "code"
                },
                " CPU class."
              ]
            ],
            "tag": "list"
          }
        ]
      ],
      "New features and bug fixes": [
        [
          {
            "items": [
              [
                "Corrected the DWARF IDs used by the R16-R31 registers added by APX (fixes HSD-18039292554)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Fixed a situation when a target using 5-level EPT paging caused VMP to misinterpret it as 4-level EPT paging (fixes HSD-15016077738)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Honor PT2GPA and EPT on the first Processor Trace packets when tracing starts disabled due to context."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Fixed a bug in ia32_spec_ctrl MSR handler that caused some side effects when no side effects access was used (fixes HSD-14022136686)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Fixed a bug that could cause incorrect state component offsets when saving compacted XSAVE state if non-saved aligned components were included (fixes HSD-14022348780)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Add SEAM safe address checks for RTIT. Intel® TDX key bits cannot be set in mask or address when it is  outside the SEAM (fixes HSD-18020627633)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Ensure that the MXCSR mask always reports the same value in all simulation engines on Intel® 64 Architecture targets (fixes HSD-15015935589)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Fix CR4.FRED handling upon GETSEC[ENTERACCS/EXITAC] (fixes HSD-18038889559)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Run single_step if inside opcode that clears TF. Fixes one of the problems reported in (fixes HSD-15015891903)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "De-enumerate MPX on all CPU models that claimed to support it. MPX has been officially deprecated since 2019. It has been operating as NOPs in Simics since 2022. It is no longer enumerated in CPUID (fixes HSD-1309925665 and HSD-18038801416."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Fix IDTR:LIMIT handling upon GETSEC[ENTERACCS/EXITAC] (fixes HSD-18038890251)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Clear pending debug exception on cpu reset. Fixes an issue where old pending debug exception could be delivered after reset."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "The rflags register is now exposed to TCF through the describe_registers interface (fixes HSD-18038862421)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Fix calculation of max XSAVE area required in CPUID.0DH.00H:EBX and ECX (fixes HSD-18038659155)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Handle VMX injected event while MTF is enabled. Fixes one of the problems reported in (fixes HSD-15015916269)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "More precise check for reserved bits in CR3. Fixes one of the problems reported in (fixes HSD-15015916269)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Fixed crash on cross-page Processor Trace write in VMX mode (fixes HSD-15012410613)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Removed a ",
                {
                  "code": "INST_INFO: 0xX",
                  "tag": "code"
                },
                " debug printout accidentally left in the VM exit code (fixes HSD-14022562102)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Handle #DB/#BP when RTM advanced debug enabled. Fixes one of the problems reported in (fixes HSD-15015916269)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Use MSR 0x2d9 FUSA_CAPABILITIES fields STARTUP_SCAN_BIST[0] and PERIODIC_SCAN_BIST[4] to determine if SAF is enumerated (fixes SIMICSTS-1318)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Correct DR6 register and exit qualifier VMCS field. Bits in DR6 are no longer cleared after every #DB, and VCMS field exit qualifier will have all bits correctly set if more than 1 exception scenario happens on the same cycle. This fixes one of the problems reported in (fixes HSD-15015916269)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Use MSR 0x2d9 FUSA_CAPABILITIES.SBFT[8] to determine if SBFT is enumerated (fixes SIMICSTS-1316)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Change Processor Trace packet order so MODE.Exec is in between coupled FUP and TIP."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Fix writing to MSR ACTIVATE_SCAN (0x2c6). Start using mask taken from register drop, instead of hardcoded value (fixes SIMICSTS-1317)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Fix writing to MSR ACTIVATE_SBFT (0x2bc). Start using mask taken from register drop, instead of hardcoded value (fixes HSD-18020627607)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Set EXT bit in the interrupt error code correctly (fixes HSD-15013738894)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Implement Processor Trace TIP package generation scenarios: IRET, SYSENTER/SYSEXIT, SYSCALL/SYSRET, JMPABS."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Do not report mixing reset flows for unrelated processors (fixes SIMICSTS-1305)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Fix Processor Trace TNT branch taken detection in case where taken and not-taken destinations differ only by page part of the address."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Fix writing invalid page part of the address to LBR_x_TO MSRs (fixes HSD-18034413312)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Fix invalid IP payload generation in Processor Trace TIP packet when near return crosses page boundary (fixes HSD-18035194187)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Implement 64-bit IP payload for Processor Trace FUP, TIP and TIP.PGE packets."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Add information about linear address masking (LAM) in 4- and 5-level paging modes for user code (LAM_U48 and LAM_U57) to layout of CR3 available via describe_registers interface (fixes HSD-18031041673)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Add TNT buffer flush on Processor Trace PSB packet (fixes HSD-18035192151)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Change Processor Trace CYC packet format to match the specification."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Add SEAM safe address check for APIC_BASE. Upper bits cannot be set in address when it is outside the SEAM (fixes SIMICSTS-1259)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Add SEAM safe address check for TME_EXCLUDE. Upper bits cannot be set in address when it is outside the SEAM (fixes SIMICSTS-1261)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Revert SEAM safe mask check for PRMRR. Following the documentation, PRMRR_MASK ignores bits above physical size in calculations (fixes HSD-14022009940)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Add clearing of CPU caches at SMM exit to protect SMM-private memory from being accessible outside SMM (fixes HSD-15014556607)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Fixed handling of SIPI signals during Application Processor startup (fixes HSD-15015543927)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Add SEAM safe address check for HW_FEEDBACK_PTR. Intel® TDX key bits cannot be set in address when it is outside the SEAM (fixes SIMICSTS-1258)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Implement Processor Trace Paging Information Packet generation (fixes HSD-18021309126)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Fixed delivery of INIT signals received in Virtual Machine Extensions (VMX) root mode (fixes HSD-13011704431)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Add SEAM safe address and mask checks for FUSARR. Intel® TDX key bits cannot be set in mask or address when it is outside the SEAM (fixes SIMICSTS-1255)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Add SEAM safe address and mask checks for PRMRR. Intel® TDX key bits cannot be set in mask or address when it is outside the SEAM (fixes SIMICSTS-1254)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Removed support for usage of final opcodes other than [0x0f, 0x00, 0xc4] from the ",
                {
                  "code": "sgx_mcheck_module",
                  "tag": "code"
                },
                " attribute."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Add SEAM safe address and mask checks for SMRR2. Intel® TDX key bits cannot be set in mask or address when it is outside the SEAM (fixes SIMICSTS-1253)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Add SEAM safe address and mask checks for SMRR. Intel® TDX key bits cannot be set in mask or address when it is outside the SEAM (fixes SIMICSTS-1252)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Fix activity state machine on signal trigger (fixes HSD-22014874712 )."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Added check to be ensured that physical addresses in MTRR ranges not be accessed by VMP when CPU not in SMM mode (fixes HSD-15014556607)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Ensured monitored address range established using MONITOR/MWAIT is cleared while asserting the INIT# pin (fixes HSD-15015405027)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Bit2 of ia32_mcu_enumeration depends on the value of 2 other MSRs. bit3 of prmrr_base_0 and bit10 of prmrr_mask (fixes HSD-14018515716)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Improvement of variable MTRR ranges support. Supported number of variable MTRR ranges as enumerated in IA32_MTRRCAP.VCNT field (bits 0-7). Static amount of cached ranges changed to VCNT dynamic base. Car support updated in acordance of relevant changes of variable MTRR ranges (fixes HSD-15010401529)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Added missing minimum ACM size validation to GETSEC[ENTERACCS] (fixes HSD-18036827407)."
              ]
            ],
            "tag": "list"
          }
        ]
      ]
    }
  },
  {
    "build_id": 7034,
    "version": "7.2.0",
    "notes": {
      "Intel® 64 public cores": [
        [
          {
            "items": [
              [
                "Added new optional \"format\" parameter to trace-msr and trace-msr-read commands"
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Added a check that ACM fits into MTRR range in the CPU classes starting ",
                {
                  "code": "x86-wlc",
                  "tag": "code"
                },
                " and ",
                {
                  "code": "x86-tnt",
                  "tag": "code"
                },
                " (implements HSD-22020285641)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Removed ACM alignment requirement in the CPU classes starting ",
                {
                  "code": "x86-wlc",
                  "tag": "code"
                },
                " and ",
                {
                  "code": "x86-tnt",
                  "tag": "code"
                },
                " (implements HSD-22020285641)."
              ]
            ],
            "tag": "list"
          }
        ]
      ],
      "New features and bug fixes": [
        [
          {
            "items": [
              [
                "Added Processor Trace CYC packets generation for PIP and TNT, changed standalone CYC frequency."
              ]
            ],
            "tag": "list"
          }
        ]
      ]
    }
  },
  {
    "build_id": 7044,
    "version": "7.3.0",
    "notes": {
      "Intel® 64 public cores": [
        [
          {
            "items": [
              [
                "Add MSR IA32_DEBUGCTL[2] bit to reserved mask for the ",
                {
                  "code": "x86-alderlake",
                  "tag": "code"
                },
                " CPU class (fixes HSD-14023239580)."
              ]
            ],
            "tag": "list"
          }
        ]
      ]
    }
  },
  {
    "build_id": 7045,
    "version": "7.4.0",
    "notes": {
      "New features and bug fixes": [
        [
          {
            "items": [
              [
                "Optimized writes to TPR in VMP when the target enables interrupt virtualization in VMX non-root mode. This noticeably improves performance when running Windows with Virtualization-based Security enabled on the target."
              ]
            ],
            "tag": "list"
          }
        ]
      ]
    }
  },
  {
    "build_id": 7049,
    "version": "7.5.0",
    "notes": {
      "New features and bug fixes": [
        [
          {
            "items": [
              [
                "Added Processor Trace VMCS packet generation and VMX scenarios for FUP, PIP, TIP and MODE.Exec (fixes HSD-18039542262)."
              ]
            ],
            "tag": "list"
          }
        ]
      ]
    }
  },
  {
    "build_id": 7062,
    "version": "7.6.0",
    "notes": {
      "New features and bug fixes": [
        [
          {
            "items": [
              [
                "Host processors older than the fourth generation Intel(R) Core(TM) processors (formerly Haswell) are no longer supported."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Fixed a rare bug in Processor Trace PSB+ FUP generation that caused incorrect FUP.IP payload"
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Fix SMM flow (HSD-14018530725)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Fix callbacks for MSR 0x2e2 - 0x2e5 (fixes HSD-16026004728)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Check reserved guest physical address width bits in guest page table entries in VMX non-root mode (partially fixes HSD-15015896288)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Fixed a bug in Processor Trace PSB+ generation when packet_en transitions to enabled. FUP and MODE.Exec are suppressed until TIP.PGE is sent."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Implemented Power Event Trace enumeration and packet generation (implements HSD-18013500825)."
              ]
            ],
            "tag": "list"
          }
        ]
      ]
    }
  },
  {
    "build_id": 7064,
    "version": "7.7.0",
    "notes": {
      "New features and bug fixes": [
        [
          {
            "items": [
              [
                "Fixed attribute for SGX feature: removed side effects when setting the value."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Instead of ambiguous \"64-bit mode\" used before, ",
                {
                  "code": "print-registers",
                  "tag": "code"
                },
                " is updated to mention specifically 4- and 5-level paging modes."
              ]
            ],
            "tag": "list"
          }
        ]
      ]
    }
  },
  {
    "build_id": 7068,
    "version": "7.8.0",
    "notes": {}
  },
  {
    "build_id": 7071,
    "version": "7.9.0",
    "notes": {
      "New features and bug fixes": [
        [
          {
            "items": [
              [
                "Implemented IP Filter type 1 for Processor Trace (HSD-18041345372)."
              ]
            ],
            "tag": "list"
          }
        ],
        [
          {
            "items": [
              [
                "Fixed Processor Trace bug causing PSB packets with FUP indicating branch target to appear before TIP for that branch (fixes HSD-18041507035)."
              ]
            ],
            "tag": "list"
          }
        ]
      ]
    }
  },
  {
    "build_id": 7076,
    "version": "7.10.0",
    "notes": {
      "New features and bug fixes": [
        [
          {
            "items": [
              [
                "Implemented IP Filter type 2 for Processor Trace (HSD-18041345372)."
              ]
            ],
            "tag": "list"
          }
        ]
      ]
    }
  },
  {
    "build_id": 7077,
    "version": "7.11.0",
    "notes": {
      "New features and bug fixes": [
        [
          {
            "items": [
              [
                "Fix for wrong RIP on VMEXIT when PREEMPTION TIMER=0 and #DB exception (partial fix for HSD-15015916269)."
              ]
            ],
            "tag": "list"
          }
        ]
      ]
    }
  }
]